In [6]:
import pandas as pd
import numpy as np

In [2]:
# 랜덤으로 두개의 1부터 10까지 수로 이루어진 3x3 배열을 생성한 뒤 두 번째 배열에 첫번째 배열의 총합을 더한 배열을 출력하라

In [7]:
df_1 = pd.DataFrame(np.random.randint(1, 10, (3,3)), columns=list('ABC'))

In [9]:
df_1

   A  B  C
0  5  5  8
1  4  2  3
2  8  6  2

In [14]:
A_sum = df_1['A'].sum()

In [15]:
A_sum

17

In [16]:
B_sum = df_1['B'].sum()

In [17]:
B_sum

13

In [18]:
C_sum = df_1['C'].sum()

In [20]:
C_sum

13

In [21]:
sum = A_sum + B_sum + C_sum
sum

43

In [22]:
df_2 = pd.DataFrame(np.random.randint(1, 10, (3,3)), columns=list('ABC'))
df_2

   A  B  C
0  8  2  3
1  9  5  6
2  8  6  5

In [23]:
df_3 = df_2 + sum
df_3

    A   B   C
0  51  45  46
1  52  48  49
2  51  49  48